benchmarks/cases/real_cases/GRI_tutorial/balanced/Allrun
cp ../common/blockMeshDict system/
cp ../common/decomposeParDict system/
cp ../common/controlDict system/

./Allclean
blockMesh > log.blockMesh
decomposePar > log.decompose
N_PROCS=$(find processor* -maxdepth 0 -type d | wc -l)
mpirun -np $N_PROCS reactingFoam -parallel > log.reactingFoam




